# Пользователь вводит сколько килограммов яблок он хочет купить
# и цену за 1 килограмм яблок - 3.5, 3, 2, 0.5
# Нужно вывести, сколько будут стоить эти яблоки
apples_weight = float(input('Килограммов яблок: '))
price_per_kg = float(input('Цена за кг яблок:'))
print('Конечная стоимость яблок:', apples_weight * price_per_kg)

