# Пользователь вводит сколько денег он хочет перевести из одной валюты в другую
# И вводит конвертацию - 1.5
# Кроме этого он вводит какая валюта входная и выходная
# Нужно при помощи функции распечатать сколько в итоге у пользователя будет денег


# def convert_currency(money_amount, rate):
#     print(f'{money_amount * rate}')
#
#
# initial_money_amount = float(input('Enter the initial amount of money: '))
# conversion_rate = float(input('Enter the conversion rate: '))
#
# convert_currency(initial_money_amount, conversion_rate)

# Написать функцию, которая проверяют у вас наступил пенсионный возраст или нет
# Пользователь вводит свой возраст
